# Los Pollos Hermione - ร้าน Fast food #1

# สวัสดีครับ ผมเป็นเจ้าของร้าน Los Pollos Hermione ครับ โดยทางร้านผมทำกิจการเกี่ยวกับ Fast food ครับ โดยจุดเด่นทางร้านผมก็คือเมนูไก่ทอดต่างๆที่หอม กรอบและอร่อยกว่าร้านอื่นๆที่พบเห็นได้ทั่วไปครับ แต่ถึงอย่างนั้นร้านก็มีเมนูที่หลากหลายให้กับลูกค้ากลุ่มบริโภคที่แตกต่างกันครับ

# แต่ว่าพอถึงเวลาต้องสรุปงบดุลของกิจการร้าน กลับพบว่าบิลต่างๆของร้านนั้นมันเยอะแยะจนผมต้องเสียเวลาเรียบเรียงและจัดแยกหมวดหมู่เองทำให้สิ้นเปลืองเวลาชีวิตผมโดยจำเป็นครับ ผมอยากจะจ้างพนักงานมาช่วยในส่วนนี้หรือนักบัญชีผมก็กังวลว่าอาจจะมีการเสกบิลหรือว่าความคลาดเคลื่อนเกิดขึ้น ทำให้ผมเรื่องๆนึงที่สามารถแก้ปัญหาในส่วนนี้ได้ครับ

# ช่วงชีวิตในวัยมหาลัยของผม มีวิชาภาคบังคับการเขียนโปรแกรมครับ ผมเลยอยากใช้ทักษะที่ผมนั้นเรียนรู้มา ในการนำมาปรับใช้กับปัญหาที่กำลังเกิดขึ้น ณ ตอนนี้ครับ

# แต่ทว่าผมกลับลืมบางส่วนเนื้อหาในบางส่วนของการเขียนโปรแกรมไปแล้วครับ นั่นก็คือในส่วนของการเก็บข้อมูลครับ ผมลืมวิธีในส่วนนี้ไปหมดแล้วครับ

# ผมอยากให้คุณช่วยผมหน่อยในบางส่วน ผมอยากเก็บข้อมูลบิลทั้งหมด โดยที่ผมนึกวิธีนึงที่อาจารย์ผมคอยย้ำครับ ว่าถ้าอยากเก็บข้อมูล ให้ลองใช้โครงสร้างแบบ Linked List ในกรณีที่จำเป็นครับ ซึ่งตอนนี้สำหรับผมคือกรณีจำเป็นครับ :<

# !Restricted Word: import list() dict() [] {} [ ]
# ^ Required Word: class

output = "LPH: "
i = 0

class bill:
    def __init__(self, item):
        self.item = item

    def curitem(self):
        allak = "Item " + str(i+1) + ": "
        allak += self.item
        return allak
    
loopamount = int(input())
for i in range(loopamount):
    myitem = input()
    totaled = bill(myitem)
    output += totaled.curitem()
    if i == loopamount-1:
        break
    else:
        output += " -> "
print(output)



                            # &   Made by Parattakorn Boonprakob :P   & #
                        # !!! IF YOU USE THIS CODE, PLEASE CREDIT THE ORIGINAL !!! #
                                    # ???   Thanks for reading =Δ=   ??? #

                                            # ~ From the team, ~ #
                                         #  ^「The Procasinators」^  #